pub const REQUEST_NAME: &str = "Как вас называть?";

pub const REQUEST_GENDER: &str = "Теперь выберите ваш пол";
pub const GENDER_MALE: &str = "Я парень";
pub const GENDER_FEMALE: &str = "Я девушка";

pub const REQUEST_GENDER_FILTER: &str = "Кого вы хотите заботать?";
pub const GENDER_FILTER_MALE: &str = "Парня";
pub const GENDER_FILTER_FEMALE: &str = "Девушку";
pub const GENDER_FILTER_ANY: &str = "Не важно";

pub const REQUEST_GRADE: &str = "В каком вы сейчас классе?\n Примечание: если \
                                 вы, например, окончили 9-ый класс, но ещё не \
                                 поступили в 10-ый - вы в 9-ом.";

pub const EDIT_SUBJECTS: &str = "Какие предметы вы ботаете? Нажмите на \
                                 предмет, чтобы добавить или убрать его.";

pub const EDIT_PARTNER_SUBJECTS: &str =
    "Выберите предметы, хотя бы один из которых должен ботать тот, кого вы \
     ищете. Нажмите на предмет, чтобы добавить или убрать его.";

pub const EDIT_ABOUT: &str =
    "Расскажите о себе: чем занимаетесь, кого хотите найти";
pub const SUBJECTS_CONTINUE: &str = "Продолжить";
pub const SUBJECTS_PARTNER_EMPTY: &str = "Не важно";
pub const SUBJECTS_USER_EMPTY: &str = "Никакие";

pub const EDIT_LOCATION_FILTER: &str =
    "Где вы хотите искать людей?\nПо всей стране, в своём федеральном округе, \
     в своём субъекте федерации или только в своём городе?";

pub const NO_CITY: &str =
    "Так как вы не указали свой город, мы будем искать людей по всей России";

pub const REQUEST_SET_PHOTOS: &str = "Отправьте парочку своих фото";

pub const REQUEST_CITY: &str =
    "Напишите название города, в котором вы живёте. Система найдёт город с \
     наиболее похожим названием и попросит подтвердить.\n\nСовет: даже если \
     вы живёте в очень маленьком городе, всё равно лучше указать именно его: \
     на следующем шаге вы сможете выбрать, что ищете людей в своей области \
     или по всей России.";

pub const CANT_FIND_CITY: &str = "Не удалось найти город! Попробуйте ввести его \
    имя более точно.\nСовет: посмотрите список городов \
    https://ru.wikipedia.org/wiki/Список_городов_России.";

pub const REQUEST_SET_DATING_PURPOSE: &str =
    "Ради чего вы хотите познакомиться? Можно выбрать несколько вариантов.";

pub const PLEASE_CREATE_PROFILE: &str = "Чтобы начать смотреть анкеты, \
                                         сначала необходимо заполнить свою. \
                                         Воспользуйтесь командой /newprofile";

pub const PARTNER_NOT_FOUND: &str =
    "К сожалению, не удалось никого найти.\nСовет: попробуйте ослабить \
     фильтры или просто немного подождать, так как наш бот не отправляет \
     анкеты одних и тех же людей чаще одного раза в некоторое время.";

pub const READY_FOR_DATINGS: &str = "Готовы начать путешествие? Жмите кнопку \
                                     ниже или используйте команду /date!";

pub const START: &str = "Добро пожаловь в бот знакомств для олимпиадников По \
                         ЛюБВИ! Рекомендуем подписаться на наш канал: https://t.me/bvilove, там мы будем публиковать новости об обновлениях и проводить опросы о желаемом функционале.\nДавайте начнём с создания анкеты.\n\nВ случае \
                         возникновение любых проблем или вопросов обращайтесь \
                         к @averyanalex.";

pub const SEND_LIKE: &str =
    "Введите сообщение, которое вы хотите отправить вместе с лайком";

pub const REQUEST_EDIT: &str = "Что вы хотите изменить?";
